{
	"titleimage": "myimages/personal/title.jpg",
	"themecolor": "#ED421C",

	"personaldata": {
		"image": "myimages/personal/portrait.jpg",
		"name": "Ralf Westphal",
		"position": "Freelance trainer, consultant, author",
		"shortbio": "I'm an enthusiast when it comes to sustainable software development aka clean code and lean/agile. But I'm also a non-conformist and approach things in a very eclectic manner.",
		"location": "Hamburg, Germany",
		"socialmedia": [
			{
				"icon": "web",
				"url": "https://ralfw.de",
				"tooltip": "Homepage"
			},
			{
				"icon": "web",
				"url": "https://ralfw.de/blog",
				"tooltip": "Current blog (en/de)"
			},
			{
				"icon": "email",
				"url": "info@ralfw.de"
			},
			{
				"icon": "twitter",
				"url": "https://twitter.com/ralfw"
			},
			{
				"icon": "xing",
				"url": "http://www.xing.com/profile/Ralf_Westphal"
			},
			{
				"icon": "linkedin",
				"url": "https://www.linkedin.com/in/ralf-westphal/"
			},
			{
				"icon": "web",
				"url": "https://blog.ralfw.de",
				"tooltip": "Previous blog (de)"
			},
			{
				"icon": "web",
				"url": "http://geekswithblogs.net/theArchitectsNapkin",
				"tooltip": "Previous blog (en): The Architects Napkin"
			},
			{
				"icon": "web",
				"url": "https://weblogs.asp.net/ralfw",
				"tooltip": "First blog (de/en): Sudelbücher"
			},
			{
				"icon": "web",
				"url": "http://ccd-school.de/blog/",
				"tooltip": "Blog of Clean Code Developer School"
			},
			{
				"icon": "instagram",
				"url": "https://www.instagram.com/ralfw2014/"
			}
		],

		"workhistory": [
			{
				"from": "1980-05-01",
				"until": "1983-06-30",
				"jobtitle": "Pupil",
				"description": "High School",
				"tags": [
				],
				"achievements": [
					{
						"title": "Early work",
						"description": "The first serious projects I did were a Forth compiler and a 3D graphics library. I even wrote about the latter in the magazine 'Computer Persönlich'.",
						"tags": [ "writing", "de" ],
						"images": [ "myimages/work/1983.jpg"	]
					},
					{
						"title": "Apple II w/ Z80 board",
						"description": "My second computer was an Apple II. But apart from a single job which required BASIC programming I did not do much on the 6502 process. Mostly I worked on the Z80 board, did assembler programming and later used UCSD Pascal.",
						"tags": [ ],
						"images": [	]
					},
					{
						"title": "Pascal, C",
						"description": "My first 'real' programming language was Pascal. I loved it and used it in school, too. Later I got my hands on a C compiler and even was able to link its output to Modula libraries. Great stuff!",
						"tags": [ ],
						"images": [	]
					},
					{
						"title": "TRS-80",
						"description": "My first computer was a TRS-80 and it was great fun to program it in Z80 assembler.",
						"tags": [ ],
						"images": [	]
					}
				]
			},
			{
				"from": "1984-10-10",
				"until": "1993-12-10",
				"jobtitle": "Student",
				"description": "University of Hamburg",
				"tags": [
				],
				"achievements":[
					{
						"title": "Vordiplom",
						"description": "Got the Vordiplom (a certificate along the lines of a Bachelor) in 1990. But it's just of some symbolic value to me. Finally in 1993 I quit studying.",
						"tags": [ ],
						"images": [ ]
					},
					{
						"title": "Jobs",
						"description": "Did student assistant jobs at the AI research lab and a municipal company in Hamburg. Projects included programming a 'more user friendly than vi' text editor on Unix in C, and data driven applications in a 4GL on Sinix (a Siemens version of Unix).",
						"tags": [ ],
						"images": [ ]
					},
					{
						"title": "Introduction to Pascal",
						"description": "Finished an introductory book on Pascal I had started with a friend back in high school. We thought it to be used in schools in computer science classes like we had attended.",
						"tags": [ "writing", "de" ],
						"images": [ ],
						"url":"https://www.dropbox.com/s/8z03vb6pc85j8ux/Pascal%20-%20Eine%20kinderleichte%20Einf%C3%BChrung%20-%20Ralf%20Westphal.pdf?dl=0"
					},
					{
						"title": "Studies",
						"description": "Studied Computer Science and Japanese language 'the regular way' from 1984 until 1986. After that, though,... I was rarely seen on campus.",
						"tags": [ ],
						"images": [ ]
					}
				]
			},
			{
				"from": "1986-04-01",
				"until": "1987-12-31",
				"jobtitle": "Co-founder and CEO",
				"description": "Kaspersoft GmbH",
				"tags": [ ],
				"achievements":[
					{
						"title": "Too successful to continue",
						"description": "After just some 1.5 years one of our customers wants to buy us. And indeed we quit our consulting business with one of the partners actually joining the customer - and me starting a new company.",
						"tags": [ ],
						"images": [ ]
					},
					{
						"title": "Becoming self-employed",
						"description": "Founded a small IT consulting company with a fellow student and a friend of his. We felt there was a need for 'lightweight' hardware consulting and custom software development. Our tools: C on IBM PC compatible and Atari computers.",
						"tags": [ ],
						"images": [ "myimages/work/kaspersoft.jpg" ]
					}
				]
			},
			{
				"from": "1988-01-01",
				"until": "1998-09-30",
				"jobtitle": "Co-founder and CEO",
				"description": "Riposte Software",
				"website":"http://riposte.com",
				"tags": [ ],
				"achievements":[
					{
						"title": "Moving on",
						"description": "From 1996 I focused more and more on R&D within our company. This even lead to writing articles for the new VB magazine BasicPro. Eventually I realized I needed to move on. Constantly working on the same product and providing a living for employees was not my thing anymore.",
						"tags": [ "writing" ],
						"images": [ "myimages/work/basicproartikel.png" ]
					},
					{
						"title": "Still growing",
						"description": "In 1994 there are 3-4 (part time) employees on board our start-up. We had to move once more. At the same time we're expanding our product mix: We come up with a visual catalog software which can also do ad hoc bill of materials calculations. And we're starting to look at this thing called 'World Wide Web'. Visual Basic had become the tool of our choice. We even did a rewrite of our main product in VB.",
						"tags": [ ],
						"images": [ "myimages/work/danzigerstr.jpg" ]
					},
					{
						"title": "Slowly growing",
						"description": "In 1991 we're finally ready to move out of our initial tiny, windowless office into a larger one and even get our first two employees on board.",
						"tags": [ ],
						"images": [ "myimages/work/firmenschild.jpg", "myimages/work/riposte2.jpg" ]
					},
					{
						"title": "A 4GL to the rescue",
						"description": "Our first version of the standard software we're selling is done in a 4GL called Amber. We're very productive and the market received our tool quite well. We're happt to present it at the largest trade show of the industry.",
						"tags": [ ],
						"images": [ "myimages/work/messe.jpg" ]
					},
					{
						"title": "A real start-up",
						"description": "Founded a new company in 1988 to bring modern software to small to medium sized companies in the roller-shutter industry. A market, as it seems, with great potential. The new company is bootstrapped like the first.",
						"tags": [ ],
						"images": [ "myimages/work/riposte1.jpg" ]
					}
				]
			},
			{
				"from": "1990-09-01",
				"until": "1991-08-31",
				"jobtitle": "Programmer/IT admin",
				"description": "ISM/ISE, Washington D.C.",
				"tags": [ ],
				"website": "https://ismguide.com",
				"achievements": [
					{
						"title": "A gig in Italy",
						"description": "In summer of 1991 I went to Milan, Italy, for a 2 month gig for ISM at Digital Equipment. We were supposed to develop a next generation CRM software using C++. Unfortunately this went like many software projects go... A lot of money was burned due to insufficient clarity of requirements and lack of experience with this new shiny language tool C++. But that also was a time when I got interested in object-oriented databases.",
						"tags": [ ],
						"images": [ "myimages/work/cpp.jpg" ]
					},
					{
						"title": "A programmer abroad",
						"description": "I always wanted to work in the US. When finally there was an opportunity to do that in 1990 I took a 12 month 'sabbatical' from my work at the start-up and went to Washington, DC, to work with a small consulting company. There I was head of software development and IT admin.",
						"tags": [ ],
						"images": [ "myimages/work/ise.jpg" ]
					}
				]
			},
			{
				"from": "1998-10-01",
				"until": "2001-05-30",
				"jobtitle": "Editor in chief",
				"description": "BasicPro magazine",
				"tags": [ "writing", "de" ],
				"achievements":[
					{
						"title": "Entering the developer conference circus",
						"description": "While working for the BasicPro I started doing talks and workshops at developer conferences. The BasicPro had one of its own, the BASTA! But Microsoft soon hired me to do talks at their conferences, too.",
						"tags": [ ],
						"images": [ ]
					},
					{
						"title": "Visual Basic rulez!",
						"description": "I was so excited about this RAD tool from Microsoft: Visual Basic. I wrote two articles for each edition of the VB magazine BasicPro in addition to being its editor-in-chief.",
						"tags": [ "writing", "de" ],
						"images": [ "myimages/work/basicpro.png" ]
					}
				]
			},
			{
				"from": "2000-01-01",
				"until": "2005-12-31",
				"jobtitle": "Microsoft Regional Director",
				"description": "Microsoft RD Program",
				"website": "https://rd.microsoft.com/en-us/",
				"tags": [ ],
				"achievements":[
					{
						"title": "Meeting Bill Gates",
						"description": "In 2001 I was asked by Microsoft to do an on stage interview with Bill Gates at their biggest developer conference in Germany at that time.",
						"tags": [ ],
						"images": [ "myimages/work/billg.jpg" ]
					},
					{
						"title": "Being a Microsoft .NET community evangelist",
						"description": "For 5 years I worked pretty closely with Microsoft Germany on spreading the good news about everything .NET. I spoke at many conferences, did roadshows, and even initiated and organized developer conferences with them (e.g. XML in Action).",
						"tags": [ ],
						"images": [ ]
					}
				]
			},
			{
				"from": "2006-01-01",
				"until": "2010-12-31",
				"jobtitle": "Microsoft Most Valued Professional",
				"description": "Microsoft MVP Program",
				"website": "https://mvp.microsoft.com",
				"tags": [ ]
			},
			{
				"from": "2009-01-01",
				"until": "2018-04-30",
				"jobtitle": "Co-founder",
				"description": "Clean Code Developer School",
				"website": "http://ccd-school.de",
				"tags": [ ],
				"achievements":[
					{
						"title": "Co-founded Clean Code training brand",
						"description": "As it turned out German developers wanted more support for getting up to speed with clean code development. So Stefan Lieser and I created the 'Clean Code Developer School' as our brand for trainings on the subject. First we did trainings together to develop a common understanding and format; then we continued individually to be able to serve the growing interest in this topic.",
						"tags": [ ],
						"images": [ ],
						"url": "http://ccd-school.de"
					},
					{
						"title": "Co-founded German Clean Code initiative",
						"description": "In 2008 I was very impressed by Robert C. Martin's book 'Clean Code'. When I met Stefan Lieser who also was intrigued by those ideas we decided to join forces to bring them to the attention of the German developer community. We set up a wiki with 42 principles and practices for clean code development and started promoting it...",
						"tags": [ ],
						"images": [ ],
						"url": "http://clean-code-developer.de"
					}
				]
			},
			{
				"from": "2001-06-01",
				"until": "today",
				"jobtitle": "Freelance trainer, consultant, author, speaker",
				"description": "One Man Think Tank",
				"website":"http://ralfw.de",
				"tags": [ ],
				"achievements":[
					{
						"title": "Going online with videos",
						"description": "So far I never really got to setting up my own Youtube channel or the like. No (or not many) canned videos from me online or as video courses. But: In 2018 I realized that it's fun and very effective to do clean code trainings online. Sometimes it's 1:1 sessions, sometimes there are up to 5 attendees. Online training makes it feasible to work in short sessions more frequently. That's very convenient for all parties, it's much more flexible to plan, it's more intense, and more individual than offline/on site trainings. I'll continue to offer on site trainings, of course - but more training time will move online for effectiveness and flexibility. (And to be honest: travelling around by train is a pain these days. So I want to minimize my time waiting for 'playing children' to clear the tracks and other impediments the Deutsche Bahn is suffering from.",
						"tags": [ ],
						"images": [ "myimages/work/onlinetraining.png" ],
						"url": "https://ralfw.de/high-value-team-angebote/"
					},
					{
						"title": "Video adventures",
						"description": "From maybe 2003 until 2005 I produced a couple of video series for Microsoft and the dotnetpro magazine with my buddy Sebastian Baumgartner and later my girlfriend. The episodes strived for a mix of entertainment and information. Some of the videos were as short as 10-15 minutes, but some extended to 60 minutes or more. Writing the script, producing it on location, and in the end editing the videos was great fun - but in the end very unfortunately beyond the shrinking budgets of my sponsors.",
						"tags": [ ],
						"images": [ "myimages/work/dotnettv.png", "myimages/work/dotnettv1.jpg" ],
						"url": "https://www.youtube.com/watch?v=VRFtRZ8Pzwo"
					},
					{
						"title": "Meeting my hero",
						"description": "Finally, in 2005, after 25 years I met the hero of my youth: Niklaus Wirth, the inventor of Pascal and Modula and seminal books on compiler construction and algorithms and data structures. We both were panelists at the iX conference. We got along well on the podium and had a lovely chat over lunch.",
						"tags": [ ],
						"images": [ "myimages/work/wirth.jpg" ]
					},
					{
						"title": ".NET Twins",
						"description": "Together with Christian Weyer - co-author on one of my books and fellow MS Regional Director - I founded the '.NET Twins' duo in 2003 to help the community to get up to speed with the then new .NET platform. We had quite some fun doing developer events together...",
						"tags": [ ],
						"images": [ "myimages/work/twins.jpg" ]
					},
					{
						"title": "The first Mono conference",
						"description": "In 2002 together with SIGS-DATACOM I organized the first Mono conference. Miguel de Icaza, Ted Neward, and other well known experts from the then young .NET community came to give the audience an idea of how multi-platform .NET might look. We've come a long way since then...",
						"tags": [ ],
						"images": [ "myimages/work/dotnetone.jpg" ]
					},
					{
						"title": "Taking up the book challenge",
						"description": "At the beginning of my freelancer carreer I was offered the opportunity to write a couple of books. That was an interesting experience compared to writing magazine articles - but after four books I realized it somewhat ran against how I like to work. It was too much about following a plan set up by a publishing company.",
						"tags": [ "writing" ],
						"images": [ "myimages/work/signierstunde.jpg" ]
					},
					{
						"title": "Becoming a 'One Man Think Tank'",
						"description": "In 2001 I quit my job as the editor-in-chief for BasicPro to focus more on working with Microsoft, being a speaker, and doing consulting. I called my business 'One Man Think Tank' because that's what I was doing: thinking about stuff others don't have time to do - and then writing and talking about my findings in blogs and articles.",
						"tags": [ ],
						"images": [ ],
						"url": "http://ralfw.de"
					}
				]
			}
		]
	},

	"classifiedads": [
		{
			"caption": "My Open Source Projects",
			"backgroundcolor": "#FBEEE6",
			"ads": [
				{
					"title": "csrun",
					"description": "A simple console runner for C# - with a twist. It let's you focus on the logic and can run tests continuously in the background. Very useful for programming novices!",
					"url": "https://github.com/ralfw/csrun",
					"progress": 100,
					"images": [ "myimages/ads/csrun.png"
					],
					"tags": [
					]
				},
				{
					"title": "bashforms",
					"description": "A .NET/Mono framework to add text based GUIs to your console applications. (Also available as a NuGet package.)",
					"url": "https://github.com/ralfw/bashforms",
					"progress": 90,
					"images": [ "myimages/ads/bashforms.png"
					],
					"tags": [
					]
				},
				{
					"title": "My Résumé",
					"description": "A HTML/JS/CSS/JSON template to present your résumé in the form you see right here.",
					"url": "https://github.com/ralfw/myresume",
					"progress": 90,
					"images": [ ],
					"tags": [ ]
				},
				{
					"title": "Service Host",
					"description": "A small framework to turn a simple C# class into a hosted HTTP/REST service. It makes starting with micro service architectures very easy. (Also available as a NuGet package.)",
					"url": "https://github.com/ralfw/servicehost",
					"progress": 100,
					"images": [ ],
					"tags": [ ]
				},
				{
					"title": "AppCfg",
					"description": "A simple framework to make command line parsing in .NET applications a no-brainer. Parameters can also be read from a JSON config file or environment variables. (Also available as a NuGet package.)",
					"url": "https://github.com/ralfw/appcfg",
					"progress": 100,
					"images": [ ],
					"tags": [ ]
				},
				{
					"title": "Equalidator",
					"description": "Makes value-based comparisons of object graphs trivial in test code. (Also available as a NuGet package.)",
					"url": "https://github.com/ralfw/Equalidator",
					"progress": 100,
					"images": [ ],
					"tags": [ ]
				}
			]
		},

		{
			"caption": "My Publications",
			"backgroundcolor": "",
			"ads": [
				{
					"title": "Leanpub",
					"description": "eBooks in different formats: ePub/mobi, PDF, web",
					"url": "https://leanpub.com/u/ralfw",
					"images": [ ],
					"tags": ["writing", "en", "de"  ]
				},
				{
					"title": "Amazon",
					"description": "eBooks and print books",
					"url": "https://www.amazon.com/s/ref=nb_sb_noss?url=search-alias%3Daps&field-keywords=ralf+westphal+software+kindle&rh=i%3Aaps%2Ck%3Aralf+westphal+software+kindle",
					"images": [ ],
					"tags": ["writing", "en", "de"  ]
				},
				{
					"title": "dotnetpro",
					"description": "Hundreds of articles in Germany's largest (.NET) developer magazine since 2003.",
					"url": "http://dotnetpro.de",
					"images": [ ],
					"tags": ["writing", "de"  ]
				},
				{
					"title": "OBJEKTspektrum",
					"description": "Dozens of articles in one of Germany's most popular OO/agile magazines.",
					"url": "https://www.sigs-datacom.de/fachzeitschriften/objektspektrum.html",
					"images": [  ],
					"tags": [ "writing", "de" ]
				}


			]
		},

		{
			"caption": "Popular Articles from My Blogs",
			"backgroundcolor": "#FBEEE6",
			"ads": [
				{
					"title": "Magically Predictable Software Production",
					"description": "Invitation to a thougt experiment: Would a magic box which automatically produces good code but which cannot be asked how long that will take be useful to a product owner? What do you think?",
					"url": "https://ralfw.de/2018/09/magically-predictable-software-production/",
					"images": [ "myimages/ads/magical.png" ],
					"tags": ["writing", "en"  ]
				},
				{
					"title": "Dependencies Flow Down Abstractions",
					"description": "Thoughts on where in software dependencies between functions/classes make sense - and where not.",
					"url": "https://ralfw.de/2018/07/dependencies-flow-down-abstractions/",
					"images": [ "myimages/ads/dependencies.png" ],
					"tags": [ "writing", "en" ]
				},
				{
					"title": "Stratified Design over Layered Design",
					"description": "Use the power of abstraction to make your code more readable and easier to test.",
					"url": "https://ccd-school.de/2017/06/stratified-design-over-layered-design/",
					"images": [ "myimages/ads/strata.png" ],
					"tags": ["writing", "en"  ]
				},
				{
					"title": "Do You Want to Stay Productive?",
					"description": "On the reasons why clean code development is essential if you want to stay in business.",
					"url": "https://ralfw.de/2018/07/do-you-want-to-stay-productive/",
					"images": [ "myimages/ads/stayproductive.png" ],
					"tags": ["writing", "en"  ]
				},
				{
					"title": "TDD - How Can It Be Done Right?",
					"description": "Many are struggling with TDD. But there are ways to improve the practice. 5 steps to more TDD satisfaction.",
					"url": "https://ralfw.de/2018/08/tdd-how_it_can_be_done_right/",
					"images": [ "myimages/ads/tdddoneright.png" ],
					"tags": ["writing", "en"  ]
				},
				{
					"title": "Messaging - The Missing Ingredient",
					"description": "There's something missing in discussion about OOP vs FP. It's messaging as the inventor of OO - Alan Kay - envisioned communication between objects to happen.",
					"url": "https://ralfw.de/2018/04/messaging-the-missing-ingredient/",
					"images": [ "myimages/ads/messaging.png" ],
					"tags": ["writing", "en"  ]
				},
				{
					"title": "Kontrollstrukturen in der Integration",
					"description": "Das IOSP verbietet zwar eigentlich Kontrollstrukturen in der Integration... doch am Ende zählt nicht das Prinzip, sondern der zu erreichende Zweck. Ab und an sind daher Kontrollstrukturen akzeptabel auch in Integrationsfunktionen.",
					"url": "https://ccd-school.de/2017/02/kontrollstrukturen-in-der-integration/",
					"images": [ "myimages/ads/kontrollstrukturen.png" ],
					"tags": ["writing", "de"  ]
				},
				{
					"title": "Schluss mit defensiver Programmierung",
					"description": "Defensive Programmierung erzeugt Rauschen und kostet Zeit. Aber es geht auch anders und systematischer.",
					"url": "https://ccd-school.de/2017/01/schluss-mit-defensiver-programmierung/",
					"tags": ["writing", "de"  ]
				},
				{
					"title": "Software in Gerüsten bauen",
					"description": "Gerüste sind Hilfskonstruktionen, die die Herstellung beschleunigen - auch wenn sie nach Fertigstellung 'weggeworfen werden'. Eine Praktik, die sich auch die Softwareentwicklung zunutze machen kann.",
					"url": "https://ccd-school.de/2016/12/software-in-geruesten-bauen/",
					"images": [ "myimages/ads/gerueste.jpg" ],
					"tags": ["writing", "de" ]
				},
				{
					"title": "There is no such thing as technical debt",
					"description": "Technical debt is a popular metapher for 'dirty code' and how it comes about. But I think it's completely besides the point for several reasons.",
					"url": "https://medium.com/clean-code-development/there-is-no-such-thing-as-technical-debt-44cf4ab3ce91",
					"images": [ "myimages/ads/technicaldebt.jpeg" ],
					"tags": ["writing", "en" ]
				}
			]
		},

		{
			"caption": "Books I'd Like to Recommend",
			"backgroundcolor": "",
			"ads": [
				{
					"title": "'Idea Flow' by Janelle Klein",
					"description": "A modern strategy for systematically optimizing software productivity with a data-driven feedback loop. By measuring the pain or “friction” in developer experience, we can identify the biggest problems, understand the causes, and run experiments to systematically learn what works. It's data-driven software mastery.",
					"url": "https://leanpub.com/ideaflow",
					"images": [ "myimages/ads/ideaflow.jpeg" ],
					"tags": [ ]
				},
				{
					"title": "'When Will It Be Done' by Daniel S. Vacanti",
					"description": "The definitive guide on Lean-Agile forecasting that gives you all the tools you need in order to answer your customers' most important question.",
					"url": "https://leanpub.com/whenwillitbedone",
					"images": [ "myimages/ads/whenwillitbedone.jpeg" ],
					"tags": [ ]
				},
				{
					"title": "'The Flaw of Averages' by Sam L. Savage",
					"description": "A must-read for anyone who makes business decisions that have a major financial impact. Sam Savage­, known for his creative exposition of difficult subjects­, describes common avoidable mistakes in assessing risk in the face of uncertainty. Along the way, he shows why plans based on average assumptions are wrong, on average, in areas as diverse as healthcare, accounting, the War on Terror, and climate change. In his chapter on Sex and the Central Limit Theorem, he bravely grasps the literary third rail of gender differences.",
					"url": "https://www.amazon.com/Flaw-Averages-Underestimate-Risk-Uncertainty-ebook",
					"images": [ "myimages/ads/flawofaverages.jpg" ],
					"tags": [ ]
				},
				{
					"title": "'Company-wide Agility' by Jutta Eckstein, John Buck",
					"description": "Today companies are expected to be flexible and both rapidly responsive and resilient to change, which basically asks them to be Agile. Lack of an overarching theory about how to expand the Agile Manifesto has led to many fragmented attempts to apply Agile company-wide. All of these perspectives are true, but the perspective is always from within the discipline. The authors' new perspective synthesizes different approaches (Agility, Sociocracy, Open Space, Beyond Budgeting) and invites you to take a new, overview perspective that can truly address the challenges of doing business in a volatile, uncertain, complex, and ambiguous world.",
					"url": "https://www.amazon.com/Company-wide-Agility-Beyond-Budgeting-Sociocracy-ebook/dp/B07B269SVW",
					"images": [ "myimages/ads/companywideagility.jpg" ],
					"tags": [ ]
				}

			]
		}
	],

	"getintouch": {
		"caption": "Get in touch!",
		"title": "You have questions, feedback, want to book a training?",
		"description": "Write me an email or use the contact form linked to below.",
		"mode": "page",
		"url": "https://ralfw.de/kontakt/"
	}
}